[
    {
        "title": "Sr Software Engineer - Team Lead",
        "company": "UnitedHealth Group - Optum",
        "date": "Jan 2022 - Current",
        "location": "Raleigh, North Carolina, United States.",
        "description": "UnitedHealth Group is a health care and well-being company with team members in two distinct and complementary businesses - Optum and UnitedHealthcare - working to help build a modern, high-performing health system.",
        "projects": [
            {
                "projectName": "Provider Search Experience",
                "projectDescription": "Currently leading a federated team to develop and enhance the Optum Provider Search Experience — a key product used by millions of people to help patients easily find and connect with healthcare providers within the Optum network. This platform offers a user-friendly, dynamic search tool that allows users to filter providers based on multiple criteria such as location, specialty, language, and gender, making it easier for patients to access the right care. By improving the search functionality and overall user experience, the product plays a critical role in empowering millions of patients and streamlining healthcare access."
            },
            {
                "projectName": "Optum Data Exchange",
                "projectDescription": "Led a team in developing user interface applications for the Optum Data Exchange platform, a critical system that facilitates the secure and efficient exchange of clinical data between healthcare providers. Focused on enhancing the platform's usability and performance, enabling providers to access and share patient data seamlessly. This work directly supports the healthcare industry's transition to more integrated and data-driven care, improving patient outcomes and operational efficiency."
            }
        ],
        "skills": [
            "HTML5",
            "CSS3",
            "JavaScript",
            "Angular 17",
            "React",
            "Java Spring Boot",
            "GraphQL",
            "Ngx Bootstrap",
            "Karma",
            "Jasmine Unit Test",
            "JSON",
            "SPLUNK",
            "SASS",
            "Node",
            "npm",
            "Agile",
            "Jenkins",
            "Genesis",
            "Visual Studio Code",
            "Postman",
            "Source Tree",
            "GIT",
            "Rally",
            "Azure Cloud"
        ],
        "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/companies/uhg.jpg",
        "url": "https://www.optum.com/en/"
    },
    {
        "title": "Software Developer",
        "company": "Egen Solutions",
        "date": "Feb 2018 - Dec 2021",
        "location": "Naperville, Illinois, United States.",
        "description": "Egen Solutions is an enterprise web and mobile application development firm dedicated to build better user experiences at the for front of design. Egen also has an IT Talent Acquisition division and places highly skilled tech professionals in companies across the US.",
        "projects": [
            {
                "projectName": "Client Onboaring - Raymond James Financial, Inc. ",
                "projectDescription": "Contributed to the development and enhancement of the Client Onboarding application — a mission-critical, web-based platform used by Raymond James Financial Advisors and internal teams to efficiently open, manage, and maintain client profiles and financial accounts. Played a key role in implementing new features, optimizing workflows, and ensuring regulatory compliance, resulting in a more streamlined and user-friendly onboarding experience. The platform supports thousands of users daily and is integral to the firm's client relationship management and operational efficiency."
            }
        ],
        "skills": [
            "HTML5",
            "CSS3",
            "JavaScript",
            "AngularJS 1.6 and 8",
            "Angular Material",
            "Ngx Bootstrap",
            "Java Spring Boot",
            "AJAX",
            "JSON",
            "SASS",
            "LESS",
            "Node",
            "npm",
            "Agile",
            "Jenkins",
            "Genesis",
            "Visual Studio Code",
            "IntelliJ",
            "Postman",
            "Source Tree",
            "GIT",
            "TFS"
        ],
        "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/companies/egen.jpg",
        "url": "https://egen.ai/"
    },
    {
        "title": "Application Developer",
        "company": "Kent State University",
        "date": "Nov 2016 - Dec 2017",
        "location": "Kent, Ohio, United States.",
        "description": "Kent State University is a large, primary residential, public research university in Kent, Ohio. It has serval IT divisions which services on software solutions to the Organization. The application Service Request Management is a part of Technology Department at University College which supports day-to-day jobs of managing a wide range of requests such as IT support requests, project requests, service requests, application development requests, media design requests, etc. from internal and external clients.",
        "projects": [
            {
                "projectName": "Service Request Management",
                "projectDescription": "Developed and enhanced a comprehensive Service Request Management application for the Technology Department at University College. The platform streamlined the intake, tracking, and resolution of diverse requests — including IT support, project management, application development, media design, and other technical services — from both internal and external stakeholders. The system significantly improved operational efficiency by centralizing request workflows, automating status updates, and enabling better resource allocation. This solution played a key role in supporting the department’s day-to-day operations and elevating service delivery standards across the college."
            }
        ],
        "skills": [
            "Angular 2",
            "Type Script",
            "HTML4/5",
            "CSS3/2",
            "C#",
            "ASP/ADO.NET 4.0",
            "Bootstrap3",
            "JavaScript",
            "Responsive Web Design",
            "AJAX",
            "JSON",
            "MS SQL Server 2008",
            "Visual Studio 2017",
            "GitLab"
        ],
        "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/companies/kent.jpg",
        "url": "https://www.kent.edu/"
    }
]