{
    "about": {
        "showPatentWork": true,
        "showDownloadResume": false,
        "resumeUrl": "https://github.com/msrbaipalli/portfolio-data/blob/main/files/resume/Srinivas%20Baipalli%20Resume.pdf",
        "lines": [
            "I'm a Lead Software Engineer with a passion for building clean, intuitive, and high-performing applications. Since 2016, I’ve been helping teams bring ideas to life—designing scalable systems, solving complex problems, and delivering products that create real impact.",
            "At UnitedHealth Group – Optum, I currently lead initiatives aimed at improving healthcare access for millions of people across the U.S.",
            "Beyond engineering, I also contribute as a Solution Architect, crafting technical strategies and system designs that align with both business needs and long-term vision. I believe in building with purpose—solutions that are thoughtful, future-ready, and truly meaningful.",
            "When I'm not coding, I’m exploring new technologies and writing about tech, programming, and how innovation can shape the future of healthcare."
        ]
    },
    "articles": [
        {
            "title": "My work, featured by The AI Journal: AI-Driven Credentialing Innovation Promises 60% Faster Onboarding for U.S. Healthcare",
            "description": "Healthcare credentialing in the U.S. is on the verge of a much-needed upgrade. A patent-pending innovation currently under research explores how AI and blockchain technology can modernize verification processes, reduce onboarding delays, and strengthen trust across the U.S. healthcare ecosystem.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/featured.png",
            "articleUrl": "https://aijourn.com/ai-driven-credentialing-innovation-promises-60-faster-onboarding-for-u-s-healthcare/",
            "type": "healthcare",
            "filterTypes": "healthcare, technology"
        },
        {
            "title": "Transforming Provider Credentialing with AI and Blockchain: My Patent Journey",
            "description": "One of the biggest challenges in U.S. healthcare today lies in how we verify and manage healthcare provider information. Whether it’s patients searching for in-network doctors, insurance companies trying to process claims accurately, or providers going through tedious credentialing processes, the current system is fragmented, outdated, and inefficient.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/patent-article.jpg",
            "articleUrl": "https://medium.com/path-to-care/transforming-provider-credentialing-with-ai-and-blockchain-my-patent-journey-e54066a3cb70",
            "type": "healthcare",
            "filterTypes": "healthcare, technology"
        },
        {
            "title": "Here’s How My Innovation Can Fix Healthcare Credentialing in the U.S.",
            "description": "For the past few months, I’ve been sharing my thoughts and research on a persistent issue in healthcare: provider credentialing. If you’re new to the topic, credentialing is how health systems verify that a doctor or clinician is licensed, trained, and eligible to practice.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/patent-post.png",
            "articleUrl": "https://medium.com/path-to-care/heres-how-my-innovation-can-fix-healthcare-credentialing-in-the-u-s-e35be4d2798f",
            "type": "technology",
            "filterTypes": "healthcare, technology"
        },
        {
            "title": "Inside the AI Engine: The Technical Core of My Healthcare Credentialing Innovation",
            "description": "The process of verifying healthcare providers in the United States, confirming their licenses, credentials, sanctions, and practice history, is outdated, fragmented, and alarmingly manual. It causes delays in provider onboarding, leads to outdated directories, and exposes patients to unnecessary risks.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/06-24.png",
            "articleUrl": "https://medium.com/path-to-care/inside-the-ai-engine-the-technical-core-of-my-healthcare-credentialing-innovation-a9306179e3a5",
            "type": "technology",
            "filterTypes": "healthcare, technology"
        },
        {
            "title": "AI in Product Architecture: How I’m Designing Products That Learn and Adapt",
            "description": "When you have been in software long enough, you start noticing patterns. Not in the code, in the way products are built. It used to be simple. You planned an architecture, defined the rules, deployed it, and called it a day. The system did exactly what you told it to do and nothing more.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/08-11.png",
            "articleUrl": "https://medium.com/@msrbaipalli/ai-in-product-architecture-how-im-designing-products-that-learn-and-adapt-66a23a66eeab",
            "type": "technology",
            "filterTypes": "healthcare, technology"
        },
        {
            "title": "Progress Update: My Journey Toward Fixing U.S. Healthcare Credentialing",
            "description": "Over the past several months, I’ve been deeply focused on solving a problem that hits at the very heart of the U.S. healthcare system, provider credentialing. It’s the behind-the-scenes process that determines whether a doctor can practice at a hospital, whether a patient’s insurance covers a provider, and ultimately, how fast care can begin. The problem? It’s broken. Outdated. Painfully manual. And worst of all, it delays care and increases administrative costs.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/progress.png",
            "articleUrl": "https://medium.com/path-to-care/progress-update-my-journey-toward-fixing-u-s-healthcare-credentialing-692dfd7e2ce3",
            "type": "technology",
            "filterTypes": "healthcare, technology"
        },
        {
            "title": "How to Set Up an LLM with an MCP Server (Without Losing Your Sanity)",
            "description": "If you have been experimenting with large language models (LLMs), you may have run into that moment where you think, “This is brilliant, but why does it still make things up when I ask about real data?”",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/08-16.png",
            "articleUrl": "https://medium.com/@msrbaipalli/how-to-set-up-an-llm-with-an-mcp-server-without-losing-your-sanity-31470a342e03",
            "type": "technology",
            "filterTypes": "programming, technology"
        },
        {
            "title": "The Top 10 Booming Technologies Reshaping Healthcare in 2025",
            "description": "Healthcare is undergoing a rapid transformation. What was once seen as futuristic is now becoming a daily reality in hospitals, clinics, and even homes. Thanks to a surge in innovation, the healthcare sector is evolving to become more intelligent, efficient, and patient-centered.Healthcare is undergoing a rapid transformation. What was once seen as futuristic is now becoming a daily reality in hospitals, clinics, and even homes. Thanks to a surge in innovation, the healthcare sector is evolving to become more intelligent, efficient, and patient-centered.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/top10.png",
            "articleUrl": "https://medium.com/path-to-care/the-top-10-booming-technologies-reshaping-healthcare-in-2025-04a3b395c51c",
            "type": "technology",
            "filterTypes": "healthcare, technology"
        },
        {
            "title": "How Tech Is Reshaping the U.S. Healthcare Industry in 2025",
            "description": "We often hear that healthcare is “booming,” but the real engine behind this growth isn’t just aging demographics or rising demand — it’s technology. From cloud infrastructure to AI diagnostics, the U.S. healthcare sector is undergoing a massive digital transformation. What was once a slow-moving, paper-heavy system is now becoming smarter, faster, and more connected.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/06-10.png",
            "articleUrl": "https://medium.com/path-to-care/how-tech-is-reshaping-the-u-s-healthcare-industry-in-2025-d89cd7cf97b2",
            "type": "technology",
            "filterTypes": "healthcare, technology"
        },
        {
            "title": "How LLMs Trained on EMRs Are Reshaping Healthcare",
            "description": "Artificial Intelligence is no longer just a buzzword in healthcare. With the rise of Large Language Models (LLMs) like GPT-4o, Claude, and domain-tuned models, we’re entering a new era where AI can deeply understand and act on complex, unstructured healthcare data.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/llms-06-08.png",
            "articleUrl": "https://medium.com/path-to-care/how-llms-trained-on-emrs-are-reshaping-healthcare-8f8be9fa1f4c",
            "type": "technology",
            "filterTypes": "healthcare, technology"
        },
        {
            "title": "Agentic AI: The Missing Link in Fixing Healthcare Credentialing",
            "description": "Imagine if healthcare systems could think for themselves. What if they could react to gaps in data, verify credentials in real time, and alert stakeholders when something doesn’t look right? Not just automation, but intelligent, agentic behavior. This is the promise of Agentic AI, and it’s reshaping the future of healthcare infrastructure, starting with one of its most overlooked bottlenecks: provider credentialing.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/agentic-ai.png",
            "articleUrl": "https://medium.com/path-to-care/agentic-ai-the-missing-link-in-fixing-healthcare-credentialing-6ae5b6f94d1d",
            "type": "technology",
            "filterTypes": "healthcare, technology"
        },
        {
            "title": "Verified and Trusted: A New Era of Healthcare Transparency",
            "description": "Over the past several months, I have been writing about something that rarely makes headlines but affects every single one of us: healthcare provider credentialing. If you have followed my earlier posts, you already know what I am talking about. But if this is your first time here, let me give you a quick recap.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/05-29.png",
            "articleUrl": "https://medium.com/path-to-care/verified-and-trusted-a-new-era-of-healthcare-transparency-8ff862133f6d",
            "type": "healthcare",
            "filterTypes": "healthcare, technology"
        },
        {
            "title": "How AI, LLMs, and Smart Agents Are Powering the Future of Healthcare Credentialing",
            "description": "Imagine moving to a new town and trying to find a doctor, only to discover their information is wrong, they’re no longer practicing, or they aren’t covered by your insurance. Unfortunately, this happens more often than you think, because healthcare provider data in the U.S. is often outdated or inconsistent across systems.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/llm-ai.png",
            "articleUrl": "https://medium.com/path-to-care/how-ai-llms-and-smart-agents-are-powering-the-future-of-healthcare-credentialing-7d9fd2fa6b03",
            "type": "technology",
            "filterTypes": "healthcare, technology"
        },
        {
            "title": "From Idea to Impact: How AI Agents Can Supercharge Real-Time Healthcare Credentialing",
            "description": "In healthcare, small delays can lead to big consequences. Imagine discovering your doctor was never properly credentialed — or worse, was flagged for misconduct months ago, but the system failed to update in time.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/ai-agent-in-healthcare.jpg",
            "articleUrl": "https://medium.com/path-to-care/from-idea-to-impact-how-ai-agents-can-supercharge-real-time-healthcare-credentialing-6bb8ea1a2173",
            "type": "technology",
            "filterTypes": "healthcare, technology"
        },
        {
            "title": "Understanding Blockchain — And Why It Matters for Innovation",
            "description": "If you’ve been following the buzz around digital innovation, you’ve probably heard the term blockchain thrown around a lot. It sounds technical, even mysterious, but at its core, blockchain is a simple yet powerful technology that’s transforming the way we handle trust, data, and transparency.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/blockchain.png",
            "articleUrl": "https://medium.com/@msrbaipalli/understanding-blockchain-and-why-it-matters-for-innovation-0b5071e778b4",
            "type": "technology",
            "filterTypes": "healthcare, technology"
        },
        {
            "title": "Can AI Chatbots Really Help with Mental Health Counseling?",
            "description": "In recent years, Artificial Intelligence (AI) has quietly entered one of the most human-centered domains: mental health counseling. From chatbots that offer emotional support to apps that monitor your mood and suggest coping strategies, AI is becoming a key player in the space once reserved exclusively for therapists, psychologists, and counselors. But is this rise of AI in mental health a genuine breakthrough or just another tech trend?",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/ai-chatbot.png",
            "articleUrl": "https://medium.com/@msrbaipalli/can-ai-chatbots-really-help-with-mental-health-counseling-9ae3083c9059",
            "type": "healthcare",
            "filterTypes": "healthcare, technology"
        },
        {
            "title": "AI and Developers: A Boost to Productivity or a Drain on Thinking?",
            "description": "If you’ve been anywhere near the dev world lately, you already know. AI is not knocking. It has kicked the door down. From GitHub Copilot finishing our code like an autocomplete on steroids to Cursor suggesting entire functions before we even think of them, artificial intelligence is becoming the coding partner we never knew we needed.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/08-06.png",
            "articleUrl": "https://medium.com/@msrbaipalli/ai-and-developers-a-boost-to-productivity-or-a-drain-on-thinking-41cad3e35443",
            "type": "programming",
            "filterTypes": "programming, technology"
        },
        {
            "title": "GitHub Copilot: The First AI That Truly Thinks Like an Engineer",
            "description": "Last time, I wrote about how AI stopped being just another tool and became something more. That piece was titled “Why AI Is No Longer a Tool. It’s My Engineering Mindset.” I didn’t write it to ride the AI trend. I wrote it because it reflected what was happening to my thinking. AI had started shaping the way I approached problems, structured systems, and made technical decisions.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/08-04.png",
            "articleUrl": "https://medium.com/@msrbaipalli/github-copilot-the-first-ai-that-truly-thinks-like-an-engineer-b8eeda1cea09",
            "type": "programming",
            "filterTypes": "programming, technology"
        },
        {
            "title": "Why AI Is No Longer a Tool. It’s My Engineering Mindset.",
            "description": "Working in software engineering for years, I have always believed in adapting to change. But AI has not just been another trend for me. It has become central to how I approach engineering challenges.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/aug-02.png",
            "articleUrl": "https://medium.com/@msrbaipalli/why-ai-is-no-longer-a-tool-its-my-engineering-mindset-4c380796e9c1",
            "type": "programming",
            "filterTypes": "programming, technology"
        },
        {
            "title": "Python and AI: The Perfect Match for Innovation",
            "description": "Walk into any AI lab, open a machine learning GitHub repo, or peek inside the notebooks of a data scientist, and odds are you’ll find Python at the heart of it all. But have you ever wondered why Python is so deeply entwined with the world of artificial intelligence?",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/jul-31.png",
            "articleUrl": "https://medium.com/@msrbaipalli/python-and-ai-the-perfect-match-for-innovation-4e574276a50d",
            "type": "programming",
            "filterTypes": "programming, technology"
        },
        {
            "title": "Angular 20 + GraphQL + Spring Boot: A Dream Stack for Building Scalable AI Products",
            "description": "We are living in a time where AI is reshaping industries, from healthcare to finance, education to logistics. But building a powerful AI product is not just about training models. You need the right tech stack to bring intelligence to users in real time, securely, and at scale. That is where the trio of Angular 20, GraphQL, and Spring Boot truly shines.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/06-23.png",
            "articleUrl": "https://medium.com/@msrbaipalli/angular-20-graphql-spring-boot-a-dream-stack-for-building-scalable-ai-products-7d51a8f4cac6",
            "type": "programming",
            "filterTypes": "programming, technology"
        },
        {
            "title": "JavaScript in the AI Era: Surviving and Thriving in the Future of Development",
            "description": "As artificial intelligence reshapes the future of software development, many developers ask an important question: Where does JavaScript fit in a world increasingly driven by AI models, automation, and smart agents? Is this decades-old language still relevant, or will it fade away as newer technologies take center stage?",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/javascript_ai.png",
            "articleUrl": "https://medium.com/@msrbaipalli/javascript-in-the-ai-era-surviving-and-thriving-in-the-future-of-development-d11876306f67",
            "type": "programming",
            "filterTypes": "programming, technology"
        },
        {
            "title": "Why It’s So Hard to Manage Healthcare Provider Data in One Place in the USA",
            "description": "Imagine trying to put together a giant puzzle where every piece comes from a different company, a different city, and even a different rulebook. That’s what it’s like trying to manage healthcare provider data in the United States.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/04272025.jpg",
            "articleUrl": "https://medium.com/path-to-care/why-its-so-hard-to-manage-healthcare-provider-data-in-one-place-in-the-usa-a4c692e23d2a",
            "type": "healthcare",
            "filterTypes": "healthcare"
        },
        {
            "title": "Can Technology Heal What’s Broken in U.S. Healthcare?",
            "description": "Let’s face it — healthcare in the U.S. can feel like a maze. You get sick, try to find the right doctor, figure out if they take your insurance, wait weeks for an appointment, and then get hit with a confusing bill. It’s stressful. It’s expensive. And for a country as advanced as the U.S., it shouldn’t be this hard.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/health0422.jpg",
            "articleUrl": "https://medium.com/path-to-care/can-technology-heal-whats-broken-in-u-s-healthcare-b7e6d1ef27fd",
            "type": "healthcare",
            "filterTypes": "healthcare, technology"
        },
        {
            "title": "How Does AI Actually Work? A Simple Guide With Real-Life Examples",
            "description": "If you’ve ever asked Siri for a weather update, binged a Netflix show it suggested, or chatted with a virtual assistant, you’ve already had a brush with Artificial Intelligence. These days, AI is everywhere as businesses race to integrate it into their products, and it’s a hot topic in everyday conversations.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/ai_general.png",
            "articleUrl": "https://medium.com/@msrbaipalli/how-does-ai-actually-work-a-simple-guide-with-real-life-examples-4f8432ea8613",
            "type": "general",
            "filterTypes": "technology, general"
        },
        {
            "title": "What is an AI Agent and How Is It Used?",
            "description": "We hear about Artificial Intelligence (AI) everywhere these days — from Siri helping us send texts, to chatbots answering questions on websites, to cars that practically drive themselves. But behind many of these smart systems is something called an AI Agent. Sounds a little sci-fi, right? Don’t worry — let’s break it down in a way that makes sense.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/aiagent0423.jpg",
            "articleUrl": "https://medium.com/@msrbaipalli/what-is-an-ai-agent-and-how-is-it-used-ec5bd6a59fd0",
            "type": "technology",
            "filterTypes": "technology"
        },
        {
            "title": "Meet Grok AI: Elon Musk’s Answer to the AI Revolution",
            "description": "While ChatGPT, Gemini, and Claude continue to dominate the AI landscape, a fresh contender has emerged, offering more than just conversation. It’s intelligent, current, daring, and refreshingly unfiltered.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/grok-ai.png",
            "articleUrl": "https://medium.com/@msrbaipalli/meet-grok-ai-elon-musks-answer-to-the-ai-revolution-baba552bf3fc",
            "type": "general",
            "filterTypes": "technology, general"
        },
        {
            "title": "Will AI Replace UI Developers? The Future of Frontend in an AI-First World",
            "description": "When artificial intelligence burst into the mainstream, many believed it would replace manual, repetitive jobs. But as generative AI started writing code, designing UIs, and generating entire frontend layouts in seconds, a new, more controversial question emerged:",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/07-13.png",
            "articleUrl": "https://medium.com/@msrbaipalli/will-ai-replace-ui-developers-the-future-of-frontend-in-an-ai-first-world-f484d3fcddef",
            "type": "technology",
            "filterTypes": "technology"
        },
        {
            "title": "The Role of AI in Modern Healthcare",
            "description": "Artificial Intelligence, or AI, isn’t just a fancy tech term anymore. It’s actually making a big difference in the real world, especially in healthcare. From helping doctors find problems faster to making patient care more personal, AI is changing the way we experience healthcare. In this article, I will explain how AI is used in healthcare, using simple and easy-to-understand examples.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/aihealth.jpg",
            "articleUrl": "https://medium.com/path-to-care/the-role-of-ai-in-modern-healthcare-eb108c43f13f",
            "type": "healthcare",
            "filterTypes": "healthcare, technology"
        },
        {
            "title": "Angular’s Selectorless Components — A Clean Way to Reuse Logic",
            "description": "Angular is always improving, and one of the newer features that developers are starting to notice is selectorless components. If you’re building large, reusable UIs and want more control over your HTML structure, this feature is worth checking out.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/angular-selectorless.jpg",
            "articleUrl": "https://medium.com/@msrbaipalli/angulars-selectorless-components-a-clean-way-to-reuse-logic-173c203efff3",
            "type": "programming",
            "filterTypes": "programming"
        },
        {
            "title": "The Wild Ride of Windsurf AI: From $3B Deal Collapse to Google and Cognition Power Moves",
            "description": "The world of AI moves fast, but few stories have been as wild as what happened with Windsurf AI. In just three days, it shot to fame, crashed hard, and then came back swinging. Along the way, it got caught in a high-powered tug-of-war between OpenAI, Google, and Cognition AI. Think executive shakeups, messy licensing fights, and a last-second buyout that left everyone in the industry talking.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/windsurf.png",
            "articleUrl": "https://medium.com/@msrbaipalli/the-wild-ride-of-windsurf-ai-from-3b-deal-collapse-to-google-and-cognition-power-moves-a55bc4065a9d",
            "type": "general",
            "filterTypes": "technology, general"
        },
        {
            "title": "How AI is Changing the Way We Code (And Why It’s Pretty Awesome)",
            "description": "Lately, I’ve been thinking about how much the developer world has changed in just the past couple of years, especially with AI stepping into our daily workflows. It’s honestly wild how fast things are moving.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/aicoding.jpg",
            "articleUrl": "https://medium.com/@msrbaipalli/how-ai-is-changing-the-way-we-code-and-why-its-pretty-awesome-262d8fa56f14",
            "type": "technology",
            "filterTypes": "technology, programming"
        },
        {
            "title": "The Impact of AI on Modern App User Interfaces",
            "description": "The way we interact with apps today is drastically different from just a few years ago. We’re no longer tapping through rigid menus or waiting for static pages to load. Now, apps feel more alive — learning from us, adapting to us, and even talking back. What’s behind this transformation? One big driver is Artificial Intelligence (AI).",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/AI.jpg",
            "articleUrl": "https://medium.com/@msrbaipalli/the-impact-of-ai-on-modern-app-user-interfaces-7750c6be7e8b",
            "type": "technology",
            "filterTypes": "technology, programming"
        },
        {
            "title": "The Other Side of the Coin: How Not to Use AI (That No One Talks About)",
            "description": "Artificial Intelligence is everywhere. It recommends what we watch, helps doctors catch diseases early, and even writes poetry. With so much hype and excitement, it is easy to forget that not every use of AI is a good use.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/not-to-think-ai.png",
            "articleUrl": "https://medium.com/@msrbaipalli/the-other-side-of-the-coin-how-not-to-use-ai-that-no-one-talks-about-a5049e22e021",
            "type": "technology",
            "filterTypes": "technology"
        },
        {
            "title": "Leveraging GraphQL for Healthcare Provider Data",
            "description": "We know how critical accurate and structured provider data is in today’s digital healthcare systems. Whether it’s helping patients connect with the right doctors, managing complex provider directories, or supporting insurance networks, backend systems must be fast, scalable, and adaptable.We know how critical accurate and structured provider data is in today’s digital healthcare systems.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/graphqlhealthcare.jpg",
            "articleUrl": "https://medium.com/@msrbaipalli/leveraging-graphql-for-healthcare-provider-data-c5a881232d44",
            "type": "healthcare",
            "filterTypes": "healthcare, programming"
        },
        {
            "title": "Understanding Angular Standalone Components",
            "description": "If you’ve been working with Angular, you probably know the usual drill: you create a component, and then you add it to a module. It’s like the component needs a home (the module) before it can exist in your app. But guess what? With the introduction of standalone components in Angular 14, that’s no longer a strict rule. ",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/angular.jpg",
            "articleUrl": "https://medium.com/@msrbaipalli/understanding-angular-standalone-components-60f29ec18ac8",
            "type": "programming"
        },
        {
            "title": "How Powerful GraphQL Is: Combining Multiple APIs into One Unified Interface",
            "description": "GraphQL has completely changed how I approach APIs. I used to think of it as a nice-to-have — a buzzword from dev conferences. But the moment I used it to unify multiple data sources into one clean API layer, I was sold. In this intro guide, I break down what GraphQL is, how it compares with REST",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/graphql.jpg",
            "articleUrl": "https://medium.com/@msrbaipalli/how-powerful-graphql-is-combining-multiple-apis-into-one-unified-interface-da81c1e5af6b",
            "type": "programming"
        },
        {
            "title": "Revolutionizing Healthcare Provider Search: Enhancing Access and Efficiency",
            "description": "In today’s fast-paced digital world, finding the right healthcare provider should be as seamless as ordering a meal or booking a flight. However, many patients still face significant hurdles in identifying the best providers for their needs. A robust and user-friendly healthcare provider search system is essential to ensure that individuals can access quality care without unnecessary delays.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/1.jpg",
            "articleUrl": "https://medium.com/path-to-care/revolutionizing-healthcare-provider-search-enhancing-access-and-efficiency-ee1fb1393af0",
            "type": "healthcare"
        },
        {
            "title": "How a Simple and Smart UI Can Make Finding Healthcare Providers Easier",
            "description": "Let’s be honest — searching for a healthcare provider online can be frustrating. You’re already dealing with health concerns, and the last thing you need is a clunky website with confusing menus, endless clicks, and outdated information. A well-designed, intuitive user interface (UI) can change all that, making it easier and faster to find the right doctor. Here’s how:",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/2.jpg",
            "articleUrl": "https://medium.com/path-to-care/how-a-simple-and-smart-ui-can-make-finding-healthcare-providers-easier-6425adc16c1a",
            "type": "healthcare"
        },
        {
            "title": "Improving Access to Healthcare: The Role of AI in Provider Search",
            "description": "In the evolving landscape of healthcare, one of the most significant challenges is ensuring that individuals can easily find the right healthcare providers. Access to quality healthcare is not just about the availability of services but also the ease of locating them. In my previous articles, I discussed how a smart UI design can simplify this process",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/3.jpg",
            "articleUrl": "https://medium.com/path-to-care/improving-access-to-healthcare-the-role-of-ai-in-provider-search-4346b484a854",
            "type": "healthcare"
        },
        {
            "title": "AI-Based Provider Matching: Transforming Healthcare Access",
            "description": "In my previous article, Improving Access to Healthcare: The Role of AI in Provider Search, I discussed how AI is reshaping the way patients find healthcare providers. Expanding on that, this article explores AI-based provider matching and how it enhances personalization and efficiency in healthcare access.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/4.jpg",
            "articleUrl": "https://medium.com/path-to-care/ai-based-provider-matching-transforming-healthcare-access-d952b2acfe4f",
            "type": "healthcare"
        },
        {
            "title": "Vibe Coding: Hype, Help, or Just Noise?",
            "description": "Walk into any modern developer’s workspace today, and you might notice a shift: RGB lights glowing softly in the background, lo-fi beats playing through noise-canceling headphones, and minimalist setups that feel more like art studios than cubicles. This isn’t just a design trend.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/vibe-coding.png",
            "articleUrl": "https://medium.com/@msrbaipalli/vibe-coding-hype-help-or-just-noise-8c6e4d071915",
            "type": "programming"
        },
        {
            "title": "Angular 20 Is Here - What’s New and Why It Matters for Developers",
            "description": "It is official. Angular 20 is out, and it is a major release. Whether you are an experienced Angular developer or just starting out, this update brings exciting features that modernize the framework and simplify development.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/angular20.png",
            "articleUrl": "https://medium.com/@msrbaipalli/angular-20-is-here-whats-new-and-why-it-matters-for-developers-b53abf32cf0b",
            "type": "programming"
        },
        {
            "title": "Angular 19 Signals: A New Era of Reactivity",
            "description": "If you’re an Angular developer, you’ve probably heard the buzz around Signals in Angular 19. And let me tell you, this is a game-changer! Angular has always been great, but Signals bring in a whole new level of fine-grained reactivity, making state management smoother, more efficient, and way more predictable.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/5.jpg",
            "articleUrl": "https://medium.com/@msrbaipalli/angular-19-signals-a-new-era-of-reactivity-1666fa94cb38",
            "type": "programming"
        },
        {
            "title": "Getting Started with GraphQL: A Modern API Approach",
            "description": "If you’ve ever worked with REST APIs, you know the struggle — over-fetching data, multiple endpoints, and juggling unnecessary responses. Enter GraphQL, the modern solution developers love for its flexibility and efficiency.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/6.jpg",
            "articleUrl": "https://medium.com/@msrbaipalli/getting-started-with-graphql-a-modern-api-approach-ce7adbe04017",
            "type": "programming"
        },
        {
            "title": "Fixing the Mess in Healthcare Provider Search: What’s Wrong and How We Can Solve It",
            "description": "Ever tried searching for a doctor online, only to find out their address is outdated, they’re not accepting new patients, or — worse — they’re not even in your insurance network? You’re not alone. Government reports from CMS, ASPE, and state agencies show that nearly half of provider directories contain errors. That’s a huge problem when people rely on these directories for care.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/7.jpg",
            "articleUrl": "https://medium.com/path-to-care/fixing-the-mess-in-healthcare-provider-search-whats-wrong-and-how-we-can-solve-it-e8e7d068c228",
            "type": "healthcare"
        },
        {
            "title": "Building a Unified Provider Directory: Reshaping Healthcare for Providers",
            "description": "In today’s complex healthcare system, providers struggle to keep their information accurate and up to date across multiple directories. Poor data management creates extra work, slows down care coordination, and can lead to compliance issues. A single, unified provider directory can simplify the process and make things more efficient for healthcare providers.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/8.jpg",
            "articleUrl": "https://medium.com/path-to-care/building-a-unified-provider-directory-reshaping-healthcare-for-providers-efe6b6d9fbd2",
            "type": "healthcare"
        },
        {
            "title": "How Are Healthcare Providers Being Registered Today?",
            "description": "I’ve been thinking about how healthcare providers get registered and how that whole process works. It’s actually pretty interesting and important, especially when you think about how millions of people rely on these systems to find doctors and specialists.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/9.jpg",
            "articleUrl": "https://medium.com/path-to-care/how-are-healthcare-providers-being-registered-today-a0d7cc216ba8",
            "type": "healthcare"
        },
        {
            "title": "Why Choose React?",
            "description": "React is one of the most popular JavaScript libraries for building user interfaces, especially for single-page applications. React allows to create reusable UI components that can manage complex interactions in a scalable and efficient way. Whether you're a seasoned developer or a beginner, React’s component-based architecture and declarative syntax make it a versatile tool for building modern web applications.",
            "imageUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/articles/10.jpg",
            "articleUrl": "https://www.linkedin.com/pulse/why-choose-react-srinivas-baipalli-dg82e/?trackingId=1DPdajY0B%2FlYa80gKXnKdw%3D%3D",
            "type": "programming"
        }
    ],
    "certificates": [
        {
            "title": "CS50: Introduction to Computer Science",
            "subtitle": "Edx HarvardX",
            "description": "This is a course of study offered by HarvardX, an online learning initiative of Harvard University through edX.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/edx.jpg",
            "url": "https://courses.edx.org/certificates/cfdbf919a099417ab1ea259741291ac2"
        },
        {
            "title": "Computer Science 101",
            "subtitle": "Stanford University",
            "description": "This is a course of study offered by Stanford University, an online learning initiative of Stanford University Stanford Online.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/standford.jpg",
            "url": "https://prod-cert-bucket.s3.amazonaws.com/downloads/2c9c3cc2083a47d79cc5a96a23498d7a/Statement.pdf"
        },
        {
            "title": "Introduction to Generative AI",
            "subtitle": "Google",
            "description": "It is a beginner-friendly course that explains how generative AI works, its applications, benefits, and ethical considerations, using practical examples and Google tools",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/google.jpg",
            "url": "https://www.cloudskillsboost.google/public_profiles/64096165-023c-41f0-87d3-cb1cc1fc87c6/badges/15697373"
        },
        {
            "title": "Generative AI for Healthcare",
            "subtitle": "Google",
            "description": "It introduces healthcare professionals to generative AI and large language models, covering real-world applications, prompt engineering, and ethical considerations in clinical settings.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/google.jpg",
            "url": "https://www.cloudskillsboost.google/public_profiles/64096165-023c-41f0-87d3-cb1cc1fc87c6/badges/15698353"
        },
        {
            "title": "Introduction to Vertex AI Studio",
            "subtitle": "Google",
            "description": "It offers a beginner-friendly overview of building, customizing, and deploying generative AI models using intuitive tools for prompt design, tuning, and multimodal applications.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/google.jpg",
            "url": "https://www.cloudskillsboost.google/public_profiles/64096165-023c-41f0-87d3-cb1cc1fc87c6/badges/15698738"
        },
        {
            "title": "Databricks Accredited Generative AI Fundamentals",
            "subtitle": "Databricks",
            "description": "This certification validates foundational knowledge of generative AI, including core concepts, models, applications, and ethical considerations, empowering professionals to understand and engage with emerging AI technologies.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/databricks.jpg",
            "url": "https://credentials.databricks.com/8010d58e-eaae-45af-8404-d5692b4dc091#acc.zrEmcQGU"
        },
        {
            "title": "Advanced Machine Learning Operations",
            "subtitle": "Databricks",
            "description": "This certification validates expertise in deploying, monitoring, and managing ML models at scale using Databricks, focusing on MLOps best practices, automation, and collaborative workflows.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/databricks.jpg",
            "url": "https://credentials.databricks.com/796c84c3-39c2-4b2c-a828-e6690f74d81e?username=srinivasbaipalli934408"
        },
        {
            "title": "Graph Developer - Professional",
            "subtitle": "Apollo Graphql",
            "description": "This certification demonstrate strong familiarity with Apollo Federation concepts. They can apply those concepts to build a federated supergraph or move an existing monolithic graph to federation.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/apollo.jpg",
            "url": "https://www.apollographql.com/tutorials/certifications/5ad6707f-c6c6-4ee0-be30-920877de64ed"
        },
        {
            "title": "Graph Developer - Associate",
            "subtitle": "Apollo Graphql",
            "description": "This certification demonstrates foundational knowledge of GraphQL and Apollo, including schema design, running Apollo Server 4, and performing frontend queries using Apollo Client 3.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/apollo.jpg",
            "url": "https://www.apollographql.com/tutorials/certifications/8b48798a-cb9d-498a-99a1-2352cc08610c"
        },
        {
            "title": "API Orchestration - Associate",
            "subtitle": "Apollo Graphql",
            "description": "This certification demonstrates foundational knowledge of API orchestration with Apollo Connectors, enabling REST API integration, selection mapping transformation, and orchestrating multiple REST calls using entities within a GraphQL schema.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/apollo.jpg",
            "url": "https://www.apollographql.com/tutorials/certifications/984342a0-6beb-41aa-ba88-ac30d11f62c3"
        },
        {
            "title": "Machine Learning Operations (MLOps) for Generative AI",
            "subtitle": "Google",
            "description": "This course offers streamlines model development, deployment, monitoring, and governance, enabling scalable, secure, and efficient management of generative AI workflows across enterprises.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/google.jpg",
            "url": "https://www.cloudskillsboost.google/public_profiles/64096165-023c-41f0-87d3-cb1cc1fc87c6/badges/15714885"
        },
        {
            "title": "Introduction to Responsible AI",
            "subtitle": "Google",
            "description": "This course explores ethical AI development, focusing on fairness, transparency, privacy, and accountability to ensure AI systems are trustworthy, inclusive, and aligned with human values.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/google.jpg",
            "url": "https://www.cloudskillsboost.google/public_profiles/64096165-023c-41f0-87d3-cb1cc1fc87c6/badges/15716152"
        },
        {
            "title": "Gen AI: Beyond the Chatbot",
            "subtitle": "Google",
            "description": "This course explores generative AI applications beyond chatbots, emphasizing foundation models, prompt engineering, and strategic implementation to drive business transformation across industries.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/google.jpg",
            "url": "https://www.cloudskillsboost.google/public_profiles/64096165-023c-41f0-87d3-cb1cc1fc87c6/badges/15717072"
        },
        {
            "title": "Gen AI: Unlock Foundational Concepts",
            "subtitle": "Google",
            "description": "This course introduces the basics of generative AI, covering core principles, use cases, model types, and ethical considerations to empower responsible AI development.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/google.jpg",
            "url": "https://www.cloudskillsboost.google/public_profiles/64096165-023c-41f0-87d3-cb1cc1fc87c6/badges/15728094"
        },
        {
            "title": "Gen AI: Navigate the Landscape",
            "subtitle": "Google",
            "description": "This course introduces the generative AI ecosystem, highlighting key tools, platforms, trends, and roles, helping learners understand how to effectively engage with AI technologies.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/google.jpg",
            "url": "https://www.cloudskillsboost.google/public_profiles/64096165-023c-41f0-87d3-cb1cc1fc87c6/badges/15728113"
        },
        {
            "title": "Gen AI Apps: Transform Your Work",
            "subtitle": "Google",
            "description": "This course introduces how generative AI applications can boost productivity, streamline workflows, and enhance creativity across various professional tasks and industries.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/google.jpg",
            "url": "https://www.cloudskillsboost.google/public_profiles/64096165-023c-41f0-87d3-cb1cc1fc87c6/badges/15728143"
        },
        {
            "title": "Gen AI Agents: Transform Your Organization",
            "subtitle": "Google",
            "description": "This course introduces how AI agents can automate complex tasks, improve decision-making, and drive innovation, enabling scalable transformation across entire organizations.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/google.jpg",
            "url": "https://www.cloudskillsboost.google/public_profiles/64096165-023c-41f0-87d3-cb1cc1fc87c6/badges/15728163"
        },
        {
            "title": "Machine Learning Operations (MLOps) with Vertex AI: Model Evaluation",
            "subtitle": "Google",
            "description": "This course focuses on model evaluation, performance metrics, deployment readiness, and ensuring robust, scalable ML pipelines on Google Cloud.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/google.jpg",
            "url": "https://www.cloudskillsboost.google/public_profiles/64096165-023c-41f0-87d3-cb1cc1fc87c6/badges/15838250"
        },
        {
            "title": "Introduction to Security in the World of AI",
            "subtitle": "Google",
            "description": "This course introduces key concepts to safeguard AI systems and ensure responsible, secure deployment in real-world applications.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/google.jpg",
            "url": "https://www.cloudskillsboost.google/public_profiles/64096165-023c-41f0-87d3-cb1cc1fc87c6/badges/15817585"
        },
        {
            "title": "AWS Certified Developer - Associate",
            "subtitle": "Linkedin",
            "description": "This certification validates proficiency in developing, testing, deploying, and debugging AWS cloud applications, requiring one or more years of hands-on experience in developing and maintaining AWS-based applications.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/linkedin.jpg",
            "url": "https://www.linkedin.com/learning/certificates/e760631f31af562c4deb196509993d36f88fd6a236e28186d497a755f3e090fd"
        },
        {
            "title": "AWS Certified Solutions Architect - Professional",
            "subtitle": "Linkedin",
            "description": "This certification validates advanced skills in designing distributed systems on AWS, targeting individuals with deep knowledge of AWS services, architecture best practices, and the ability to design scalable, reliable, and cost-effective solutions.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/linkedin.jpg",
            "url": "https://www.linkedin.com/learning/certificates/1e7a1f7a0ea7e0532e0c66e45a26eac74ab3e1a216b5c1ba5c736946d19670e7"
        },
        {
            "title": "Python Essential Training",
            "subtitle": "Linkedin",
            "description": "This certification offers a comprehensive introduction to Python, covering core concepts like data types, control flow, functions, and file handling, ideal for beginners and intermediates.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/linkedin.jpg",
            "url": "https://www.linkedin.com/learning/certificates/abd65b5b3363f5a40dba58f74d337aaf36bfa4a577cebe3c57b2b8a5e19c5725"
        },
        {
            "title": "Machine Learning with Python: Foundations",
            "subtitle": "Linkedin",
            "description": "This course introduces core ML concepts using Python, covering data preprocessing, supervised and unsupervised learning, and model evaluation in a beginner-friendly manner.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/linkedin.jpg",
            "url": "https://www.linkedin.com/learning/certificates/28e7cb24b75c9450ff50776f026de549efa89dd461eed9d89da2baae8422949a"
        },
        {
            "title": "Python: Working with REST and Web Data",
            "subtitle": "Linkedin",
            "description": "This course teaches how to access, retrieve, and process web data using APIs. Learn authentication, JSON parsing, and integration techniques for building real-world Python applications.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/linkedin.jpg",
            "url": "https://www.linkedin.com/learning/certificates/2cdbc3c92ffa71e08f0227d2584011674eb4b02f514d1233326002d263838e6a"
        },
        {
            "title": "GraphQL for Enterprise Developers",
            "subtitle": "Linkedin",
            "description": "This course offers a practical guide to building scalable APIs using GraphQL, tailored for enterprise environments with real-world examples, advanced patterns, and performance optimization strategies.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/linkedin.jpg",
            "url": "https://www.linkedin.com/learning/certificates/7957a92383241b4eadd9fd5ffa913b2e0e559d54d1f5df9e303c4b36c8ead797"
        },
        {
            "title": "Spring with GraphQL",
            "subtitle": "Linkedin",
            "description": "This course is designed for back-end and full-stack developers aiming to integrate GraphQL with Spring Boot. It covers building, maintaining, and evolving robust GraphQL APIs using the Spring Framework, including advanced topics like mutations, batching, telemetry, error handling, and API extension.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/linkedin.jpg",
            "url": "https://www.linkedin.com/learning/certificates/80f4b6777b36607b2eed0a62ba52ea0ee43fc7226cefb936cae13e11f75a5634"
        },
        {
            "title": "Generative AI: Working with Large Language Models",
            "subtitle": "Linkedin",
            "description": "This course introduces the fundamentals of large language models, exploring architecture, applications, training methods, and ethical considerations in building generative AI systems.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/linkedin.jpg",
            "url": "https://www.linkedin.com/learning/certificates/7d09777eed69ec2b4422800acaa171752e56b8162f2e2ddd5b8e8e4f63b3033c"
        },
        {
            "title": "Introduction to Artificial Intelligence",
            "subtitle": "Linkedin",
            "description": "This course is designed for project managers, product managers, directors, executives, and students starting a career in AI. First, learn what it means for a system to display “intelligence.” Then, explore the difference between classic predictive AI and newer generative AI.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/linkedin.jpg",
            "url": "https://www.linkedin.com/learning/certificates/66a937859dd448cc1497cfd3afd28da357bb3a09e192dc596d644ab87c9d5839"
        },
        {
            "title": "Integrating AI into the Product Architecture",
            "subtitle": "Linkedin",
            "description": "This course is designed to teach to seamlessly integrate AI into product architecture, enhancing functionality, scalability, and user experience through practical strategies, design principles, and real-world case studies for building intelligent, future-ready products.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/linkedin.jpg",
            "url": "https://www.linkedin.com/learning/certificates/de516182041b3211264f98ae5f52f5e6f449692f17c879c3db6fceb92fc27fe2"
        },
        {
            "title": "AI for Software Testers",
            "subtitle": "Linkedin",
            "description": "This course is designed to teach how to integrate AI tools into software testing processes. Discover techniques to enhance test efficiency, automation, and analysis across the software testing life cycle using modern AI solutions.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/linkedin.jpg",
            "url": "https://www.linkedin.com/learning/certificates/a09b4038fb7ed0f23def9e1acc3d06bab9c4f06a4412a8c9facae233e6212685"
        },
        {
            "title": "Introduction to Agentic AI: Getting Started with AutoGen Studio",
            "subtitle": "Linkedin",
            "description": "This course is designed to explore the fundamentals of agentic AI using AutoGen Studio. Learn how autonomous agents work, build simple AI workflows, and understand key concepts behind next-generation AI-driven applications and automation.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/linkedin.jpg",
            "url": "https://www.linkedin.com/learning/certificates/72ad1a55a93b01aa68eed96afc34cf142e705719212af11246db16a1b28151bd"
        },
        {
            "title": "The AI-Driven Software Developer: Optimize, Innovate, Transform",
            "subtitle": "Linkedin",
            "description": "This course is designed to learn to harness AI tools to optimize coding, enhance productivity, and drive innovation. This course empowers software developers to integrate AI into workflows, transforming how modern software is built.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/linkedin.jpg",
            "url": "https://www.linkedin.com/learning/certificates/51e57a9d2cc6cbda344cae3d21b9418ea28fb2cb8442e0f1cf95201f143bd705"
        },
        {
            "title": "Agentic AI Architecture Foundations: Designing Autonomous AI Systems",
            "subtitle": "Linkedin",
            "description": "This course is designed to explore core principles of agentic AI design. Learn to build autonomous systems with decision-making, planning, and interaction capabilities, laying the foundation for next-generation intelligent and self-directed AI architectures.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/linkedin.jpg",
            "url": "https://www.linkedin.com/learning/certificates/814ad98c9ee91dc8f34c8c5ec55f05cf15b2a9b2299da743c78ac3847855662f"
        },
        {
            "title": "GenAI and Predictive AI Architecture Foundations",
            "subtitle": "Linkedin",
            "description": "This course is designed to learn foundational AI architecture: understand core components and distinctions between generative (GenAI) and predictive systems, covering data pipelines, training vs inference modes, monitoring modules, and scalable real‑world design.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/linkedin.jpg",
            "url": "https://www.linkedin.com/learning/certificates/ce6a019a58e93943d48521d0327efcc0597d1251f68a5da03d339b7b93720492"
        },
        {
            "title": "AI Product Development: Secure by Design",
            "subtitle": "Linkedin",
            "description": "This course explores the integrattion of security into every stage—from governance and risk frameworks, adversarial defense, CI/CD pipelines and supply‑chain validation to monitoring and case‑based playbooks",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/linkedin.jpg",
            "url": "https://www.linkedin.com/learning/certificates/04bd066c37c52b6abcfcf0d584a1da9d59a1cd04c1fa428a2db9b08a7e5da996"
        },
        {
            "title": "Fundamentals of AI Engineering: Principles and Practical Applications",
            "subtitle": "Linkedin",
            "description": "This course explores transform software engineering expertise into full-stack AI system development—covering LLM pipelines, embeddings, vector databases, hybrid retrieval, observability, CI/CD, and production‑grade tooling with GitHub Codespaces",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/linkedin.jpg",
            "url": "https://www.linkedin.com/learning/certificates/b8d62da46d38f8d6b07271a1ade6a3f1e23bf794f1000025ffe9c34d7660a10b"
        },
        {
            "title": "Introduction to MLSecOps",
            "subtitle": "LinkedIn",
            "description": "This course explores the fusion of machine learning and security operations, emphasizing secure ML lifecycle management, threat mitigation, and collaboration across data science, DevOps, and security teams.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/linkedin.jpg",
            "url": "https://www.linkedin.com/learning/certificates/a5672b350be7c041e87df3aa7e38c1430237232bdd5717d9950485ef9263cfef"
        },
        {
            "title": "Agentic AI Fundamentals: Architectures, Frameworks, and Applications",
            "subtitle": "LinkedIn",
            "description": "This course explores how autonomous AI agents are built, structured, and deployed, covering core architectures, popular frameworks, and real-world applications driving next-generation intelligent systems.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/linkedin.jpg",
            "url": "https://www.linkedin.com/learning/certificates/1e4edb1a33c5d73100b660074d7aff2f466942e6547c3b0df6d8b9db081b205d"
        },
        {
            "title": "Artificial Intelligence and Application Security",
            "subtitle": "LinkedIn",
            "description": "This course explores how AI transforms cybersecurity, highlighting benefits, risks, and strategies for integrating intelligent systems into secure software development and threat mitigation practices.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/linkedin.jpg",
            "url": "https://www.linkedin.com/learning/certificates/46a4500150abc663e3efd4b0a4dba56ecd262a858703e52ac5ab1229a71b4c3f"
        },
        {
            "title": "Artificial Intelligence Foundations: Machine Learning",
            "subtitle": "LinkedIn",
            "description": "This course offers a beginner-friendly introduction to machine learning concepts, including supervised and unsupervised learning, model training, evaluation, and building ML pipelines.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/linkedin.jpg",
            "url": "https://www.linkedin.com/learning/certificates/a8880523cb5ff933e7515c8d5f66bea99d54dda25292631ea59381d1c7405bc4"
        },
        {
            "title": "Generative AI for Business Leaders",
            "subtitle": "LinkedIn",
            "description": "This course led by Tomer Cohen, LinkedIn’s Chief Product Officer. It equips executives with insights into generative AI's impact on business, covering applications, limitations, and strategies for leveraging this technology to drive innovation and efficiency.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/linkedin.jpg",
            "url": "https://www.linkedin.com/learning/certificates/5ba62d1981883632783b8c99398d0d03a194637540eced60aaaf08102c1c9922"
        },
        {
            "title": "Driving AI Adoption as a Business Leader",
            "subtitle": "LinkedIn",
            "description": "This course offers practical strategies for executives to integrate AI into business operations, overcome resistance, and lead successful, ethical, and scalable AI transformation initiatives.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/linkedin.jpg",
            "url": "https://www.linkedin.com/learning/certificates/1eb2289cb90b177f2cc48e1d25b6af990dc9459d3111b869c766019ecb471ab0"
        },
        {
            "title": "Artificial Intelligence and Business Strategy",
            "subtitle": "LinkedIn",
            "description": "This course explores how AI enhances competitive advantage through data-driven strategies, personalized services, and operational efficiency.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/linkedin.jpg",
            "url": "https://www.linkedin.com/learning/certificates/9780cfab02166ceed5da5fe11b337a8289857bb94b983a9c84c985e6bdad80d4"
        },
        {
            "title": "Integrating Generative AI into Business Strategy",
            "subtitle": "LinkedIn",
            "description": "This course offers a concise, practical guide for organizations aiming to adopt generative AI effectively. The course introduces the USAGE framework—Understand, Survey, Align, Guide, Evaluate—providing actionable steps to align AI initiatives with business goals, assess readiness, and implement responsibly.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/linkedin.jpg",
            "url": "https://www.linkedin.com/learning/certificates/d81be6033ef9f048c22f47374469e83698e1db024c4d1673c098379522969c3a"
        },
        {
            "title": "Amplify Your Business Writing with AI",
            "subtitle": "LinkedIn",
            "description": "This course offers practical strategies to enhance clarity, creativity, and efficiency in business communication by integrating artificial intelligence tools effectively.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/linkedin.jpg",
            "url": "https://www.linkedin.com/learning/certificates/bf47669ff691fe4552e37f24b3c3684ff78eb55d6a9b6e96adab0eb11de53535"
        },
        {
            "title": "Generative AI and Large Language Models on AWS",
            "subtitle": "LinkedIn",
            "description": "This course teaches setting up cloud-based Rust environments, building serverless workflows with AWS Lambda and Step Functions, and using tools like AWS CodeCatalyst, SageMaker, and Amazon Bedrock for model orchestration and data workflows.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/linkedin.jpg",
            "url": "https://www.linkedin.com/learning/certificates/39d0941a2dcba4f28d30457a823f2c780dde903ea2ef71b4251bbf44b67ea4f5"
        },
        {
            "title": "Generative AI: Introduction to Large Language Models",
            "subtitle": "LinkedIn",
            "description": "This course offers a beginner-friendly overview of generative AI tools like ChatGPT and DALL·E, explaining their functions and roles within the AI ecosystem.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/linkedin.jpg",
            "url": "https://www.linkedin.com/learning/certificates/c67aafd05c879b49d883de8f7402d70537ce80c1aa89e5ce03de8f421b5835a7"
        },
        {
            "title": "Blockchain: Beyond the Basics",
            "subtitle": "LinkedIn",
            "description": "This course explores advanced blockchain concepts, applications across industries, emerging trends, and future possibilities, offering a deeper understanding for professionals seeking practical, real-world insights.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/linkedin.jpg",
            "url": "https://www.linkedin.com/learning/certificates/a1d2c6681f9502f7cf9acb00f5174d4e575025ae2a832fa92406567a7b84c667"
        },
        {
            "title": "Blockchain: Learning Solidity",
            "subtitle": "LinkedIn",
            "description": "This course offers a beginner-friendly guide to mastering Solidity, the programming language essential for developing smart contracts on the Ethereum blockchain, with practical, hands-on examples.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/linkedin.jpg",
            "url": "https://www.linkedin.com/learning/certificates/e9290f9062377bde9890da803f3e4ceb2ebd7b680b5e215d07c48a7e4f262507"
        },
        {
            "title": "Programming Foundations: Design Patterns",
            "subtitle": "LinkedIn",
            "description": "This course introduces essential object-oriented design patterns like Strategy, Adapter, Observer, and Decorator, with practical Java examples and occasional insights in Python and JavaScript, ideal for intermediate developers.​",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/linkedin.jpg",
            "url": "https://www.linkedin.com/learning/certificates/59474422cbd7982a39a14150b0977bc9fe9636eb0c4d407d46228784c3e2fe19"
        },
        {
            "title": "Legacy Front End",
            "subtitle": "Free Code Camp",
            "description": "This certification is a 300-hour program designed to teach the fundamentals of web development. This certification focuses on building a strong foundation in HTML, CSS, Responsive Web Design, JavaScript, and jQuery.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/freecodecamp.jpg",
            "url": "https://www.freecodecamp.org/certification/bmsrinivasrao007/legacy-front-end"
        },
        {
            "title": "Javascript (Basic)",
            "subtitle": "Hacker Rank",
            "description": "This certification possess a basic knowledge on Javascript which covers topics like, Functions, Currying, Hoisting, Scope, Inheritance, Events and Error Handling.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/hackerrank.jpg",
            "url": "https://www.hackerrank.com/certificates/55a0177c19ef"
        },
        {
            "title": "Angular (Basic)",
            "subtitle": "Hacker Rank",
            "description": "This certification possess a basic knowledge on Angular which covers topics like MVC Frameworks, Components (Angular, Dynamic, Styling), TypeScript, Two Way Binding and Form Validation.",
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/certificates/hackerrank.jpg",
            "url": "https://www.hackerrank.com/certificates/772ff811d48c"
        }
    ],
    "educations": [
        {
            "degree": "Master of Digital Sciences",
            "university": "Kent State University",
            "date": "Aug 2016 - Dec 2017",
            "major": "Digital Systems Software Development",
            "gpa": "3.7 out of 4.0",
            "courses": [
                "Algorithm and Programming with Data Structures",
                "Enterprise Architecture",
                "Data Science",
                "Database Management Systems",
                "Application & Technology Architecture",
                "Requirements & Engineering",
                "VB Programming in Engineering",
                "Capstone in Digital Sciences"
            ],
            "iconUrl": "kent.png",
            "location": "Kent, Ohio, United States.",
            "url": "https://www.kent.edu/",
            "certificateUrl": "https://github.com/msrbaipalli/portfolio-data/blob/main/files/degrees/mastersdegree.pdf",
            "showViewCertificate": false
        },
        {
            "degree": "Bachelor of Technology",
            "university": "Jawaharlal Nehru Technology University",
            "date": "May 2012 - Apr 2016",
            "major": "Computer Science and Engineering",
            "gpa": "3.2 out of 4.0",
            "courses": [
                "Computer Programming & Data Structures",
                "Data Communications & Computer Networks",
                "Data Structure through C++",
                " Data Warehouse & Data Mining",
                "Database Management Systems",
                "Object Oriented Analysis & Design",
                "Design Patterns",
                "Design & Analysis of Algorithms",
                "Formal Languages & Automata Theory"
            ],
            "iconUrl": "jntuh.png",
            "location": "Hyderabad, Telangana, India.",
            "url": "https://jntuh.ac.in/",
            "certificateUrl": "https://github.com/msrbaipalli/portfolio-data/blob/main/files/degrees/btechdegree.pdf",
            "showViewCertificate": false
        }
    ],
    "experiences": [
        {
            "title": "Sr Software Engineer - Team Lead",
            "company": "UnitedHealth Group - Optum",
            "date": "Jan 2022 - Current",
            "location": "Raleigh, North Carolina, United States.",
            "description": "UnitedHealth Group is a health care and well-being company with team members in two distinct and complementary businesses - Optum and UnitedHealthcare - working to help build a modern, high-performing health system.",
            "projects": [
                {
                    "projectName": "Provider Search Experience",
                    "projectDescription": "Currently leading a federated team to develop and enhance the Optum Provider Search Experience — a key product used by millions of people to help patients easily find and connect with healthcare providers within the Optum network. This platform offers a user-friendly, dynamic search tool that allows users to filter providers based on multiple criteria such as location, specialty, language, and gender, making it easier for patients to access the right care. By improving the search functionality and overall user experience, the product plays a critical role in empowering millions of patients and streamlining healthcare access."
                },
                {
                    "projectName": "Optum Data Exchange",
                    "projectDescription": "Led a team in developing user interface applications for the Optum Data Exchange platform, a critical system that facilitates the secure and efficient exchange of clinical data between healthcare providers. Focused on enhancing the platform's usability and performance, enabling providers to access and share patient data seamlessly. This work directly supports the healthcare industry's transition to more integrated and data-driven care, improving patient outcomes and operational efficiency."
                }
            ],
            "skills": [
                "HTML5",
                "CSS3",
                "JavaScript",
                "Angular 17",
                "React",
                "Java Spring Boot",
                "GraphQL",
                "Ngx Bootstrap",
                "Karma",
                "Jasmine Unit Test",
                "JSON",
                "SPLUNK",
                "SASS",
                "Node",
                "npm",
                "Agile",
                "Jenkins",
                "Genesis",
                "Visual Studio Code",
                "Postman",
                "Source Tree",
                "GIT",
                "Rally",
                "Azure Cloud"
            ],
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/companies/uhg.jpg",
            "url": "https://www.optum.com/en/"
        },
        {
            "title": "Software Developer",
            "company": "Egen Solutions",
            "date": "Feb 2018 - Dec 2021",
            "location": "Naperville, Illinois, United States.",
            "description": "Egen Solutions is an enterprise web and mobile application development firm dedicated to build better user experiences at the for front of design. Egen also has an IT Talent Acquisition division and places highly skilled tech professionals in companies across the US.",
            "projects": [
                {
                    "projectName": "Client Onboaring - Raymond James Financial, Inc. ",
                    "projectDescription": "Contributed to the development and enhancement of the Client Onboarding application — a mission-critical, web-based platform used by Raymond James Financial Advisors and internal teams to efficiently open, manage, and maintain client profiles and financial accounts. Played a key role in implementing new features, optimizing workflows, and ensuring regulatory compliance, resulting in a more streamlined and user-friendly onboarding experience. The platform supports thousands of users daily and is integral to the firm's client relationship management and operational efficiency."
                }
            ],
            "skills": [
                "HTML5",
                "CSS3",
                "JavaScript",
                "AngularJS 1.6 and 8",
                "Angular Material",
                "Ngx Bootstrap",
                "Java Spring Boot",
                "AJAX",
                "JSON",
                "SASS",
                "LESS",
                "Node",
                "npm",
                "Agile",
                "Jenkins",
                "Genesis",
                "Visual Studio Code",
                "IntelliJ",
                "Postman",
                "Source Tree",
                "GIT",
                "TFS"
            ],
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/companies/egen.jpg",
            "url": "https://egen.ai/"
        },
        {
            "title": "Application Developer",
            "company": "Kent State University",
            "date": "Nov 2016 - Dec 2017",
            "location": "Kent, Ohio, United States.",
            "description": "Kent State University is a large, primary residential, public research university in Kent, Ohio. It has serval IT divisions which services on software solutions to the Organization. The application Service Request Management is a part of Technology Department at University College which supports day-to-day jobs of managing a wide range of requests such as IT support requests, project requests, service requests, application development requests, media design requests, etc. from internal and external clients.",
            "projects": [
                {
                    "projectName": "Service Request Management",
                    "projectDescription": "Developed and enhanced a comprehensive Service Request Management application for the Technology Department at University College. The platform streamlined the intake, tracking, and resolution of diverse requests — including IT support, project management, application development, media design, and other technical services — from both internal and external stakeholders. The system significantly improved operational efficiency by centralizing request workflows, automating status updates, and enabling better resource allocation. This solution played a key role in supporting the department’s day-to-day operations and elevating service delivery standards across the college."
                }
            ],
            "skills": [
                "Angular 2",
                "Type Script",
                "HTML4/5",
                "CSS3/2",
                "C#",
                "ASP/ADO.NET 4.0",
                "Bootstrap3",
                "JavaScript",
                "Responsive Web Design",
                "AJAX",
                "JSON",
                "MS SQL Server 2008",
                "Visual Studio 2017",
                "GitLab"
            ],
            "iconUrl": "https://raw.githubusercontent.com/msrbaipalli/portfolio-data/refs/heads/main/images/companies/kent.jpg",
            "url": "https://www.kent.edu/"
        }
    ],
    "skills": [
        {
            "title": "Frontend Development",
            "sections": [
                {
                    "sectionTitle": "Languages",
                    "sectionItems": [
                        "JavaScript",
                        "TypeScript",
                        "HTML5",
                        "CSS3"
                    ]
                },
                {
                    "sectionTitle": "Frameworks",
                    "sectionItems": [
                        "Angular 17+",
                        "React",
                        "React Native",
                        "LIT",
                        "Tailwind CSS",
                        "Bootstrap",
                        "Material-UI",
                        "D3.js"
                    ]
                },
                {
                    "sectionTitle": "State Management",
                    "sectionItems": [
                        "NgRx",
                        "Redux",
                        "Zustand"
                    ]
                },
                {
                    "sectionTitle": "Testing Frameworks",
                    "sectionItems": [
                        "Cypress",
                        "Playwright",
                        "Jest",
                        "Selenium"
                    ]
                },
                {
                    "sectionTitle": "Tools & Platforms",
                    "sectionItems": [
                        "Webpack",
                        "Parcel",
                        "npm",
                        "Figma"
                    ]
                }
            ]
        },
        {
            "title": "Backend Development",
            "sections": [
                {
                    "sectionTitle": "Languages",
                    "sectionItems": [
                        "Java",
                        "Python",
                        "SQL",
                        "C#"
                    ]
                },
                {
                    "sectionTitle": "Frameworks",
                    "sectionItems": [
                        "Java Spring Boot",
                        "Node.js",
                        "Express.js",
                        ".Net Entity"
                    ]
                },
                {
                    "sectionTitle": "Web Services",
                    "sectionItems": [
                        "GraphQL",
                        "REST"
                    ]
                },
                {
                    "sectionTitle": "Databases",
                    "sectionItems": [
                        "MS SQL Server",
                        "PostgreSQL",
                        "MySQL",
                        "MongoDB"
                    ]
                },
                {
                    "sectionTitle": "Tools & Platforms",
                    "sectionItems": [
                        "Postman",
                        "SPLUNK"
                    ]
                }
            ]
        },
        {
            "title": "DevOps and AI Development",
            "sections": [
                {
                    "sectionTitle": "Cloud Services",
                    "sectionItems": [
                        "Amazon Web Services (AWS)",
                        "Microsoft Azure Cloud"
                    ]
                },
                {
                    "sectionTitle": "AI Tools & Platforms",
                    "sectionItems": [
                        "OpenAI API",
                        "ChatGPT",
                        "GitHub Copilot",
                        "Databricks",
                        "Blockchain"
                    ]
                },
                {
                    "sectionTitle": "Tools & Platforms",
                    "sectionItems": [
                        "Jenkins",
                        "Docker",
                        "Git",
                        "Git Actions",
                        "SonarQube",
                        "Datadog",
                        "Rally"
                    ]
                }
            ]
        }
    ],
    "configs": {
        "articleConfigs": {
            "chipsOrder": "Show All, healthcare, programming, technology, general"
        }
    }
}